package com.gnss.core.constants.jt809;

import lombok.Getter;

/**
 * <p>Description: JT809报警类型</p>
 * <p>Company: www.gps-pro.cn</p>
 *
 * @author huangguangbin
 * @version 1.0.1
 * @date 2019/2/3
 */
@Getter
public enum Jt809AlarmTypeEnum {

    /**
     * 超速报警
     */
    ALARM_0001(0x0001, "0x0001", "超速报警"),

    /**
     * 疲劳驾驶报警
     */
    ALARM_0002(0x0002, "0x0002", "疲劳驾驶报警"),

    /**
     * 紧急报警
     */
    ALARM_0003(0x0003, "0x0003", "紧急报警"),

    /**
     * 进入指定区域报警
     */
    ALARM_0004(0x0004, "0x0004", "进入指定区域报警"),

    /**
     * 离开指定区域报警
     */
    ALARM_0005(0x0005, "0x0005", "离开指定区域报警"),

    /**
     * 路段堵塞报警
     */
    ALARM_0006(0x0006, "0x0006", "路段堵塞报警"),

    /**
     * 危险路段报警
     */
    ALARM_0007(0x0007, "0x0007", "危险路段报警"),

    /**
     * 越界报警
     */
    ALARM_0008(0x0008, "0x0008", "越界报警"),

    /**
     * 盗警
     */
    ALARM_0009(0x0009, "0x0009", "盗警"),

    /**
     * 劫警
     */
    ALARM_000A(0x000A, "0x000A", "劫警"),

    /**
     * 偏离路线报警
     */
    ALARM_000B(0x000B, "0x000B", "偏离路线报警"),

    /**
     * 车辆移动报警
     */
    ALARM_000C(0x000C, "0x000C", "车辆移动报警"),

    /**
     * 超时驾驶报警
     */
    ALARM_000D(0x000D, "0x000D", "超时驾驶报警"),

    /**
     * 违规行驶报警
     */
    ALARM_0010(0x0010, "0x0010", "违规行驶报警"),

    /**
     * 前撞报警
     */
    ALARM_0011(0x0011, "0x0011", "前撞报警"),

    /**
     * 车道偏离报警
     */
    ALARM_0012(0x0012, "0x0012", "车道偏离报警"),

    /**
     * 胎压异常报警
     */
    ALARM_0013(0x0013, "0x0013", "胎压异常报警"),

    /**
     * 动态信息异常报警
     */
    ALARM_0014(0x0014, "0x0014", "动态信息异常报警"),

    /**
     * 其他报警
     */
    ALARM_00FF(0x00FF, "0x00FF", "其他报警"),

    /**
     * 视频信号丢失报警
     */
    ALARM_0101(0x0101, "0x0101", "视频信号丢失报警"),

    /**
     * 视频信号遮挡报警
     */
    ALARM_0102(0x0102, "0x0102", "视频信号遮挡报警"),

    /**
     * 存储单元故障报警
     */
    ALARM_0103(0x0103, "0x0103", "存储单元故障报警"),

    /**
     * 其他视频设备故障报警
     */
    ALARM_0104(0x0104, "0x0104", "其他视频设备故障报警"),

    /**
     * 客车超员报警
     */
    ALARM_0105(0x0105, "0x0105", "客车超员报警"),

    /**
     * 异常驾驶行为报警
     */
    ALARM_0106(0x0106, "0x0106", "异常驾驶行为报警"),

    /**
     * 特殊报警录像达到存储阈值报警
     */
    ALARM_0107(0x0107, "0x0107", "特殊报警录像达到存储阈值报警"),

    /**
     * 超时停车
     */
    ALARM_A001(0xA001, "0xA001", "超时停车"),

    /**
     * 车辆定位信息上报时间间隔异常
     */
    ALARM_A002(0xA002, "0xA002", "车辆定位信息上报时间间隔异常"),

    /**
     * 车辆定位信息上报距离间隔异常
     */
    ALARM_A003(0xA003, "0xA003", "车辆定位信息上报距离间隔异常"),

    /**
     * 下级平台异常断线
     */
    ALARM_A004(0xA004, "0xA004", "下级平台异常断线"),

    /**
     * 下级平台数据传输异常
     */
    ALARM_A005(0xA005, "0xA005", "下级平台数据传输异常"),

    /**
     * 路段堵塞报警
     */
    ALARM_A006(0xA006, "0xA006", "路段堵塞报警"),

    /**
     * 危险路段报警
     */
    ALARM_A007(0xA007, "0xA007", "危险路段报警"),

    /**
     * 雨雪天气报警
     */
    ALARM_A008(0xA008, "0xA008", "雨雪天气报警"),

    /**
     * 驾驶员身份识别异常
     */
    ALARM_A009(0xA009, "0xA009", "驾驶员身份识别异常"),

    /**
     * 终端异常(含线路连接异常)
     */
    ALARM_A00A(0xA00A, "0xA00A", "终端异常"),

    /**
     * 平台接入异常
     */
    ALARM_A00B(0xA009, "0xA00B", "平台接入异常"),

    /**
     * 核心数据异常
     */
    ALARM_A00C(0xA00C, "0xA00C", "核心数据异常"),

    /**
     * 其他报警
     */
    ALARM_A0FF(0xA0FF, "0xA0FF", "其他报警"),

    /**
     * 拨打电话报警
     */
    SAFETY_ALARM_000E(0x000E, "0x000E", "拨打电话报警"),

    /**
     * 抽烟报警
     */
    SAFETY_ALARM_000F(0x000F, "0x000F", "抽烟报警"),

    /**
     * 分神报警
     */
    SAFETY_ALARM_0010(0x0010, "0x0010", "分神报警"),

    /**
     * 驾驶员异常报警
     */
    SAFETY_ALARM_0011(0x0011, "0x0011", "驾驶员异常报警"),

    /**
     * 碰撞报警
     */
    SAFETY_ALARM_0012(0x0012, "0x0012", "碰撞报警"),

    /**
     * 频繁变道报警
     */
    SAFETY_ALARM_0013(0x0013, "0x0013", "频繁变道报警"),

    /**
     * 胎压报警
     */
    SAFETY_ALARM_0014(0x0014, "0x0014", "胎压报警"),

    /**
     * 侧翻报警
     */
    SAFETY_ALARM_0101(0x0101, "0x0101", "侧翻报警"),

    /**
     * 前向碰撞预警
     */
    SAFETY_ALARM_0102(0x0102, "0x0102", "前向碰撞预警"),

    /**
     * 车道偏离预警
     */
    SAFETY_ALARM_0103(0x0103, "0x0103", "车道偏离预警"),

    /**
     * 车距过近预警
     */
    SAFETY_ALARM_0104(0x0104, "0x0104", "车距过近预警"),

    /**
     * 行人碰撞预警
     */
    SAFETY_ALARM_0105(0x0105, "0x0105", "行人碰撞预警"),

    /**
     * 生理疲劳驾驶预警
     */
    SAFETY_ALARM_0106(0x0106, "0x0106", "生理疲劳驾驶预警"),

    /**
     * 分神驾驶报警
     */
    SAFETY_ALARM_0107(0x0107, "0x0107", "分神驾驶报警"),

    /**
     * 驾驶员身份认证报警
     */
    SAFETY_ALARM_0108(0x0108, "0x0108", "驾驶员身份认证报警"),

    /**
     * 盲点检测报警(后方接近报警)
     */
    SAFETY_ALARM_0109(0x0109, "0x0109", "后方接近报警"),

    /**
     * 盲点检测报警(左侧后方接近报警)
     */
    SAFETY_ALARM_010A(0x010A, "0x010A", "左侧后方接近报警"),

    /**
     * 盲点检测报警(右侧后方接近报警)
     */
    SAFETY_ALARM_010B(0x010B, "0x010B", "右侧后方接近报警"),

    /**
     * 胎压异常报警(胎压定时上报)
     */
    SAFETY_ALARM_010C(0x010C, "0x010C", "胎压定时上报"),

    /**
     * 胎压异常报警(胎压过高报警)
     */
    SAFETY_ALARM_010D(0x010D, "0x010D", "胎压过高报警"),

    /**
     * 胎压异常报警(胎压过低报警)
     */
    SAFETY_ALARM_010E(0x010E, "0x010E", "胎压过低报警"),

    /**
     * 胎压异常报警(胎温过高报警)
     */
    SAFETY_ALARM_010F(0x010F, "0x010F", "胎温过高报警"),

    /**
     * 胎压异常报警(传感器异常报警)
     */
    SAFETY_ALARM_0110(0x0110, "0x0110", "传感器异常报警"),

    /**
     * 胎压异常报警(胎压不平衡报警)
     */
    SAFETY_ALARM_0111(0x0111, "0x0111", "胎压不平衡报警"),

    /**
     * 胎压异常报警(慢漏气报警)
     */
    SAFETY_ALARM_0112(0x0112, "0x0112", "慢漏气报警"),

    /**
     * 胎压异常报警(电池电量低报警)
     */
    SAFETY_ALARM_0113(0x0113, "0x0113", "电池电量低报警"),

    /**
     * 频繁变道预警
     */
    SAFETY_ALARM_0114(0x0114, "0x0114", "频繁变道预警"),

    /**
     * 急刹车
     */
    SAFETY_ALARM_0115(0x0115, "0x0115", "急刹车"),

    /**
     * 怠速停车
     */
    SAFETY_ALARM_0116(0x0116, "0x0116", "怠速停车"),

    /**
     * 低档高速
     */
    SAFETY_ALARM_0117(0x0117, "0x0117", "低档高速"),

    /**
     * 空挡滑行
     */
    SAFETY_ALARM_0118(0x0118, "0x0118", "空挡滑行"),

    /**
     * 长期异地经营报警
     */
    SAFETY_ALARM_0119(0x0119, "0x0119", "长期异地经营报警"),

    /**
     * 凌晨2时至5时行车报警
     */
    SAFETY_ALARM_0120(0x0120, "0x0120", "凌晨2时至5时行车报警"),

    /**
     * 超时疲劳驾驶报警
     */
    SAFETY_ALARM_0121(0x0121, "0x0121", "超时疲劳驾驶报警"),

    /**
     * 凌晨2时至5时行车报警
     */
    SAFETY_ALARM_0122(0x0122, "0x0122", "累计驾驶超时报警"),

    /**
     * 离线位移报警
     */
    SAFETY_ALARM_0123(0x0123, "0x0123", "离线位移报警"),

    /**
     * 超过三天车辆无上线报警
     */
    SAFETY_ALARM_0124(0x0124, "0x0124", "超过三天车辆无上线报警"),

    /**
     * 驾驶员主动报警
     */
    SAFETY_ALARM_0125(0x0125, "0x0125", "驾驶员主动报警"),

    /**
     * 区间行驶时间不足
     */
    SAFETY_ALARM_0126(0x0126, "0x0126", "区间行驶时间不足"),

    /**
     * 区间行驶时间过长
     */
    SAFETY_ALARM_0127(0x0127, "0x0127", "区间行驶时间过长"),

    /**
     * 电子围栏
     */
    SAFETY_ALARM_0128(0x0128, "0x0128", "电子围栏"),

    /**
     * 存储故障报警
     */
    SAFETY_ALARM_0129(0x0129, "0x0129", "存储故障报警"),

    /**
     * GNSS模块发生故障
     */
    SAFETY_ALARM_0130(0x0130, "0x0130", "GNSS模块发生故障"),

    /**
     * GNSS天线未接或被剪断
     */
    SAFETY_ALARM_0131(0x0131, "0x0131", "GNSS天线未接或被剪断"),

    /**
     * GNSS天线短路
     */
    SAFETY_ALARM_0132(0x0132, "0x0132", "GNSS天线短路"),

    /**
     * 终端主电源欠压
     */
    SAFETY_ALARM_0133(0x0133, "0x0133", "终端主电源欠压"),

    /**
     * 终端主电源掉电
     */
    SAFETY_ALARM_0134(0x0134, "0x0134", "终端主电源掉电"),

    /**
     * 终端LCD或显示器故障
     */
    SAFETY_ALARM_0135(0x0135, "0x0135", "终端LCD或显示器故障"),

    /**
     * TTS模块故障
     */
    SAFETY_ALARM_0136(0x0136, "0x0136", "TTS模块故障"),

    /**
     * 摄像头故障
     */
    SAFETY_ALARM_0137(0x0137, "0x0137", "摄像头故障"),

    /**
     * 终端主电源掉电
     */
    SAFETY_ALARM_0138(0x0138, "0x0138", "车辆VSS故障"),

    /**
     * 车辆油量异常
     */
    SAFETY_ALARM_0139(0x0139, "0x0139", "车辆油量异常"),

    /**
     * 道路运输证IC卡模块故障
     */
    SAFETY_ALARM_0140(0x0140, "0x0140", "道路运输证IC卡模块故障"),

    /**
     * 车辆被盗
     */
    SAFETY_ALARM_0141(0x0141, "0x0141", "车辆被盗"),

    /**
     * 超时停车
     */
    SAFETY_ALARM_0142(0x0142, "0x0142", "超时停车"),

    /**
     * 驾驶员登录认证失败
     */
    SAFETY_ALARM_0143(0x0143, "0x0143", "驾驶员登录认证失败"),

    UNKNOWN(-1, "-1", "未知报警");

    private final int value;
    private final String hexValue;
    private final String desc;

    Jt809AlarmTypeEnum(int value, String hexValue, String desc) {
        this.value = value;
        this.hexValue = hexValue;
        this.desc = desc;
    }

    public static Jt809AlarmTypeEnum fromValue(int value) {
        for (Jt809AlarmTypeEnum alarmTypeEnum : values()) {
            if (value == alarmTypeEnum.getValue()) {
                return alarmTypeEnum;
            }
        }
        return UNKNOWN;
    }

    /**
     * 获取主动安全报警枚举
     *
     * @param value
     * @return
     */
    public static Jt809AlarmTypeEnum getSafetyAlarm(int value) {
        //此区间范围的按名称查询
        if (value >= 0x000E && value < 0x00FF) {
            String name = String.format("SAFETY_ALARM_%04X", value);
            return valueOf(name);
        }
        //其余的按值查询
        return fromValue(value);
    }
}